Revit 2026 API

# ColorFillSchemeEntryFillPatternId Property

---

The id of fill pattern element of this entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId FillPatternId { get; set; }
```
```vb
Public Property FillPatternId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ FillPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member FillPatternId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

  * InvalidElementid represents no pattern, that means there would be nothing to be filled for elements colored based on this entry.
  * Only fill pattern elements whose fill pattern target is drafting is valid for color fill scheme.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace